In [2]:
import pandas as pd

In [8]:
df=pd.read_csv('data/Titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [9]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  34.5   7.8292
1         1       3  female  47.0   7.0000
2         0       2    male  62.0   9.6875
3         0       3    male  27.0   8.6625
4         1       3  female  22.0  12.2875

In [13]:
target=df.Survived
inputs=df.drop(['Survived'],axis=1)

In [14]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       0     1
3       0     1
4       1     0

In [15]:
inputs=pd.concat([inputs,dummies],axis=1)
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  34.5   7.8292       0     1
1       3  female  47.0   7.0000       1     0
2       2    male  62.0   9.6875       0     1
3       3    male  27.0   8.6625       0     1
4       3  female  22.0  12.2875       1     0

In [16]:
inputs.drop(['Sex'],axis=1,inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  34.5   7.8292       0     1
1       3  47.0   7.0000       1     0
2       2  62.0   9.6875       0     1
3       3  27.0   8.6625       0     1
4       3  22.0  12.2875       1     0

In [19]:
inputs.columns[inputs.isna().any()]

Index(['Age', 'Fare'], dtype='object')

In [22]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.Fare=inputs.Fare.fillna(inputs.Fare.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  34.5   7.8292       0     1
1       3  47.0   7.0000       1     0
2       2  62.0   9.6875       0     1
3       3  27.0   8.6625       0     1
4       3  22.0  12.2875       1     0

In [61]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test =train_test_split(inputs,target,test_size=0.2)

In [62]:
len(X_train)

334

In [63]:
len(X_test)

84

In [64]:
len(inputs)

418

In [65]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [66]:
model.fit(X_train,y_train)

GaussianNB()

In [67]:
model.score(X_test,y_test)

1.0

In [74]:
X_test[:10]

     Pclass       Age     Fare  female  male
128       2  42.00000  13.0000       0     1
33        3  30.27259  23.4500       1     0
45        3  25.00000   7.9250       0     1
377       2  21.00000  11.5000       0     1
21        3   9.00000   3.1708       0     1
225       3  30.27259  15.2458       1     0
113       3  18.50000   7.2833       1     0
36        3  30.27259   8.0500       1     0
149       2  30.00000  26.0000       0     1
47        3  30.27259   7.7500       0     1

In [70]:
y_test[:10]

128    0
33     1
45     0
377    0
21     0
225    1
113    1
36     1
149    0
47     0
Name: Survived, dtype: int64

In [75]:
model.predict(X_test[:10])

array([0, 1, 0, 0, 0, 1, 1, 1, 0, 0], dtype=int64)

In [76]:
model.predict_proba(X_test[:10])

array([[1., 0.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.]])